In [1]:
import pandas as pd
import numpy as np
frame = pd.read_csv('./data/mammals.csv')
frame.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

In [2]:
frame.columns

Index(['name', 'body', 'brain'], dtype='object')

In [3]:
frame.columns = ['name','bodyKg','brainKg']

In [4]:
frame.head()

              name   bodyKg  brainKg
0       Arctic fox    3.385     44.5
1       Owl monkey    0.480     15.5
2  Mountain beaver    1.350      8.1
3              Cow  465.000    423.0
4        Grey wolf   36.330    119.5

In [5]:
newColumnNames = {'bodyKg':'body_kg','brainKg':'brain_kg'}

In [11]:
frame.rename(columns = newColumnNames, inplace=True)

In [12]:
frame.head()

              name  body_kg  brain_kg
0       Arctic fox    3.385      44.5
1       Owl monkey    0.480      15.5
2  Mountain beaver    1.350       8.1
3              Cow  465.000     423.0
4        Grey wolf   36.330     119.5

In [13]:
frame = pd.read_csv('./data/mammals.csv', index_col='name')

In [14]:
frame.rename(index = {'Cow':'Land cow'}, inplace=True)

In [15]:
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land cow         465.000  423.0
Grey wolf         36.330  119.5

In [16]:
frameCopy=frame

In [17]:
frameCopy.loc['Arctic fox','body']=5

In [18]:
frameCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         36.33  119.5

In [19]:
frame.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         36.33  119.5

In [20]:
frameCopy = frame.copy()

In [21]:
frameCopy.loc['Grey wolf','body']=40

In [22]:
frameCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         40.00  119.5

In [23]:
frame.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         36.33  119.5